ws-mule-soap/src/main/resources/searchSiteRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://service.wellsfargo.com/provider/FSL/site/searchSites/2016/08/" xmlns:ns1="http://service.wellsfargo.com/entity/message/2003/" xmlns:ns2="http://service.wellsfargo.com/entity/communication/address/2003/" xmlns:ns3="http://service.wellsfargo.com/entity/outlet/2003/" xmlns:ns4="http://service.wellsfargo.com/entity/communication/phone/2003/">
  <soapenv:Header/>
  <soapenv:Body>
    <ns:searchSites>
      <ns1:WFContext xmlns:ns1="http://service.wellsfargo.com/entity/message/2003/">
        <ns1:messageId>d97d5fcf-c4ce-4b9d-bc6a-98098f4e8f52</ns1:messageId>
        <ns1:sessionId>BE270CF5DB5F176C037859D6480B2607</ns1:sessionId>
        <ns1:sessionSequenceNumber>1</ns1:sessionSequenceNumber>
        <ns1:creationTimestamp>2016-03-15T00:12:21.535Z
</ns1:creationTimestamp>
        <ns1:activitySourceId>Phone Bank Locator</ns1:activitySourceId>
        <ns1:hostName>DTCPCASF411CLHW</ns1:hostName>
        <ns1:billingAU>014460</ns1:billingAU>
      </ns1:WFContext>
      <siteDetails>
        <ns2:cityName>SAN DIEGO</ns2:cityName>
        <ns2:stateCode>CA</ns2:stateCode>
      <!--Option 2 -->
      <!--<ns2:postalCode>0</ns2:postalCode>-->
    </siteDetails>
  </ns:searchSites>
</soapenv:Body>
</soapenv:Envelope>
